{"prefix":"proto","id":"20150005","title":"Recycle Rush Day 5","subtitle":"Building Bits and Biting Burritos","date":"20150107","author":"Joanne Ma","sections":[{"type":"image","content":"https://farm8.staticflickr.com/7497/16040914210_8c0752e52b_o.jpg","caption":"CAD-ing the chassis.","$$hashKey":"object:56"},{"type":"text","content":"Salutations dearest reader,","$$hashKey":"object:60"},{"type":"text","content":"The Prototypes spent roughly eight hours working on various components of the robot and the field. On the programming end, the team re-imaged reimaged roboRIO, updated firmware, and installed java 8 onto Javagod’s (please refer to the previous blogs if you are utterly and hopelessly perplexed) computer. The electrical team made connectors to motor controllers in order to increase modularity and facilitate prototyping/testing. Ammar worked on CAD-ing (computer aided design) the robot and kept up with the team working on the chassis and toughbox.","$$hashKey":"object:63"},{"type":"image","content":"https://farm8.staticflickr.com/7566/15608432463_0a266469f7_o.jpg","caption":"Crimp'n like a pimp.","$$hashKey":"object:66"},{"type":"text","content":"Raymond, the safety captain, was responsible for leading the mechanical team to build the chute, which is one of the field elements. Raymond’s team constructed the field elements out of wood and based our design off of the one in the game manual. In addition, their team created a blueprint to guide the members through the construction process. Since the Prototypes value their resources and their members’ safety, everyone was equipped with goggles and gloves before the mechanical team used the handsaw, circular saw, and reciprocating saw. They first connected the two by four to the main plywood of the wall, measured out the the sidewalls of the chute, and screwed the sidewalls in place. Afterwards, they found the right angle for the chute slide, will wait to connect the chute slide top and bottom.","$$hashKey":"object:70"},{"type":"image","content":"https://farm9.staticflickr.com/8619/15605878634_e89b5ca09d_o.jpg","caption":"Protoypes work on field elements.","$$hashKey":"object:73"},{"type":"text","content":"The team was feeling a bit famished at the time, so Ammar’s father graciously ordered and delivered food so the team could re-energize and continue working. After a delectable respite, Kevin analyzed the command base FRC framework and started some test code with several members.","$$hashKey":"object:77"},{"type":"image","content":"https://farm8.staticflickr.com/7467/16040927620_b0dcd97805_o.jpg","caption":"The \"Burritozilla\" with orange sauce.","$$hashKey":"object:83"},{"type":"text","content":"Raymond’s team made base supports for the wall with two by fours and called it a day. Despite some setbacks, the Prototypes managed to accomplish goals they set and cannot wait to resume their work tomorrow.","$$hashKey":"object:87"},{"type":"image","content":"https://farm8.staticflickr.com/7519/16227490832_d73e8824df_o.jpg","caption":"No gains cause pains while working on drive trains.","$$hashKey":"object:90"}]}