{"prefix":"proto","id":"20150001","title":"FRC Kickoff 2015: Recycle Rush","subtitle":"Game Overview, Meeting Recap, and Future Plans","date":"20150103","author":"Joanne Ma","sections":[{"type":"text","content":"Greetings fellow members and curious inquirers!","$$hashKey":"object:52"},{"type":"text","content":"The Prototypes are running a blog/ photo journal  to document our journey through build season. Today was the start of the 2015 FRC season and this year’s game is… Recycle Rush!  Click on the link to view the game animation: https://www.youtube.com/watch?v=hTyCIYZQ_1s","$$hashKey":"object:55"},{"type":"text","content":"Recycle Rush is a recycling-themed game where two alliances of three teams each play on a 27ft by 54ft field.  All Recycle Rush matches begin with a 15-second autonomous period in which robots operate independently of their drivers.  Throughout this period, robots are to move yellow totes and recycling containers into the area between the scoring platforms, which are formally known as the Auto Zone. If the yellow totes are arranged in a single stack, additional points will be awarded. During the remaining 2 minutes and 12 seconds of the match, alliances compete simultaneously by stacking grey totes in designated areas, then stacking the green recycling bin on top of the grey totes, and then placing the pool noodle inside the recycling bin.","$$hashKey":"object:58"},{"type":"text","content":"Alliances can earn additional points for disposing of their litter in either their landfill zone; however, unscored litter that is left on their side of the field by the end of the match adds to the score of the other alliance.  “Coopertition Points” are award if, at some point in the math, there are at least four yellow totes on the step simultaneously.  If at least four yellow totes are placed in a single stack on the step, additional points are awarded. Teams must make attempts to maximize their score through each match in order to rank well during qualification matches and advance through the playoff matches to the finals.","$$hashKey":"object:61"},{"type":"text","content":"While the rest of the team was at rest,  Vivian, Kevin, Aakash, Justin, and Ammar braved the dark and chilly winter morning to attend the 2015 FRC kickoff at SJSU. They picked up the kit of parts, stayed for the reveal, and then returned to Kevin’s residence to begin planning for the season. The meetup began at 8:30 am and members gathered into groups to discuss ideas, thoughts, and opinions about Recycle Rush.  They had a fruitful discussion lead by Vivian and Ammar and were capable of determining functions that the robot should be capable of performing.  They created the following list:","$$hashKey":"object:64"},{"type":"image","content":"data/data_images/2015day1/discussion.jpg","caption":"A thoughtful and productive discussion.","$$hashKey":"object:70"},{"type":"text","content":"Robot Function List\n1. Pushing litter out of our autozone\n2. Moving boxes\n3. Loading boxes from ground\n4. Lifting boxes\n5. Stacking boxes\n6. Train drivers\n7. Stacking trash can\n8. Pool noodle from chute\n9. Loading boxes through chute into robot","$$hashKey":"object:74"},{"type":"text","content":"We were fortunate to have robotics alumni/alumna Crystal ‘13, Yizhe ‘13, Regina ‘14, and Richard ‘14 attend our meetup today! They provided us invaluable advice regarding the game analysis, design process, and time management.  They also created a technical list which covers the following- how to push litter, how to move boxes, how to load boxes from the ground, designs that dealt with stacking boxes, pickup systems, and loading systems.","$$hashKey":"object:77"},{"type":"image","content":"data/data_images/2015day1/gitkevin.jpg","caption":"Kevin teaches members git.","$$hashKey":"object:83"},{"type":"text","content":"Kevin Wang (herein forward referred to as “Javagod”)  and Aakash worked alongside with members, gauging each member’s understanding of the game and reviewed the game manual.  Then, they discussed point analysis,  brainstormed and identified game sequence strategies that could be utilized during the game. It was pivotal for all members to understand the game inside out so that we could make the most of our meetings.  We also created a spreadshseet that covered timing, possible points, points, maximum amounts of points, links, and FYI’s. Javagod spent time teaching members git by going over the instructions that he created on Github and then allowed individual members to test out their newfound knowledge.  Vivian also set up a calendar with important reminders so that all team members would be on the same page throughout the season. Pizza and popcorn was served, and we are all extremely grateful that Javagod hosted us!","$$hashKey":"object:87"},{"type":"text","content":"We can’t wait to see you all when school resumes. Enjoy your final day of break and happy new year!","$$hashKey":"object:90"}]}